<?php

$lang['required']			= "Поле '%s' обязательно для заполнения.";
$lang['isset']				= "Поле '%s' должно иметь значение.";
$lang['valid_email']		= "Поле '%s' должно содержать верный адрес электронной почты.";
$lang['valid_emails']		= "Все адреса электронной почты, находящиеся в поле '%s' должны быть правильными.";
$lang['valid_url']			= "Поле '%s' должно содержать корректный URL.";
$lang['valid_ip']			= "Поле '%s' должно содержать верный IP.";
$lang['min_length']			= "Поле '%s' должно быть не короче %s симв.";
$lang['max_length']			= "Поле '%s' должно быть не длиннее %s симв.";
$lang['exact_length']		= "Поле '%s' должно быть длинной точно %s симв.";
$lang['alpha']				= "Поле '%s' может содержать только буквы (латиница).";

$lang['cyr']				= "Поле '%s' может содержать только буквы (кириллица).";
$lang['cyr_alpha']			= "Поле '%s' может содержать только буквы (кириллица и латиница).";

$lang['alpha_numeric']		= "Поле '%s' может содержать только цифры и буквы (латиница).";

$lang['cyr_numeric']		= "Поле '%s' может содержать только цифры и буквы (кириллица).";
$lang['cyr_alpha_numeric']	= "Поле '%s' может содержать только цифры и буквы (кириллица и латиница).";

$lang['alpha_dash']			= "Поле '%s' может содержать только цифры, знак подчёркивания, дефис и буквы (латиница).";

$lang['cyr_dash']			= "Поле '%s' может содержать только цифры, знак подчёркивания, дефис и буквы (кириллица).";
$lang['cyr_alpha_dash']		= "Поле '%s' может содержать только цифры, знак подчёркивания, дефис и буквы (кириллица и латиница).";

$lang['numeric']			= "Поле '%s' может содержать только цифры.";
$lang['is_numeric']			= "Поле '%s' может содержать только числа.";
$lang['integer']			= "Поле '%s' может содержать только целые числа.";
$lang['regex_match']		= "Поле '%s' некорректного формата.";
$lang['matches']			= "Поле '%s' должно совпадать с полем '%s'.";
$lang['is_unique'] 			= "Поле '%s' должно содержать уникальное значение.";
$lang['is_natural']			= "Поле '%s' должно содержать ноль или положительное число.";
$lang['is_natural_no_zero']	= "Поле '%s' должно содержать число, которое больше ноля.";
$lang['decimal']			= "Поле '%s' должно содержать десятичное число.";
$lang['less_than']			= "Поле '%s' должно содержать число, которое меньше '%s'.";
$lang['greater_than']		= "Поле '%s' должно содержать число, которое больше '%s'.";


/* Конец файла form_validation_lang.php */
/* Расположение: ./application/language/english/form_validation_lang.php */